## TEST

## Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years ol

In [8]:
import pandas as pd
import numpy as np

In [7]:
age=int(input('enter your age:'))
def func(age):
    
    x=100-age
    y=2022+x
    print("your age will be 100 by the year : ", y)
    

func(age)

enter your age:10
 your age will be 100 by the year :  2112

###  What is pandas groupby? Demonstrate with your own example

In [15]:
ipl = {'Team': ['R','D','K','A','B'],
   'Rank': [1,2,2,3,3],
   'Year': [2014,2015,2014,2015,2014],
   'Points':[876,789,863,673,741]}

In [17]:
df = pd.DataFrame(ipl)
df

  Team  Rank  Year  Points
0    R     1  2014     876
1    D     2  2015     789
2    K     2  2014     863
3    A     3  2015     673
4    B     3  2014     741

In [19]:
df.groupby(['Rank']).sum() ## groupby function groups the column specified and performs the operation on the grouped values

      Year  Points
Rank
1     2014     876
2     4029    1652
3     4029    1414

## How to create a dataframe from list?

In [22]:
list1=range(10)
s=pd.DataFrame(list1)
s

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

## What are the ways to combine the dataframe in pandas. Give an example for each

In [25]:
""" combine data frames:
    merge
    inner join
    right join
    left join """

' combine data frames:\n    merge\n    inner join\n    right join\n    left join '

In [30]:
ipl1 = {'Team': ['R','D','K','A','B'],
   'Rank': [1,2,2,3,3],
   'Year': [2014,2015,2014,2015,2014],
   'Points':[876,789,863,673,741]}

xl = pd.DataFrame(ipl1)
xl

  Team  Rank  Year  Points
0    R     1  2014     876
1    D     2  2015     789
2    K     2  2014     863
3    A     3  2015     673
4    B     3  2014     741

In [31]:
ipl2 = {'Team': ['X','Y','Z','U','V'],
   'Rank': [1,2,2,3,3],
   'Year': [2016,2017,2019,2018,2020],
   'Points':[856,889,763,873,641]}

xr = pd.DataFrame(ipl2)
xr

  Team  Rank  Year  Points
0    X     1  2016     856
1    Y     2  2017     889
2    Z     2  2019     763
3    U     3  2018     873
4    V     3  2020     641

In [32]:
pd.merge(xl,xr,on='Rank')

  Team_x  Rank  Year_x  Points_x Team_y  Year_y  Points_y
0      R     1    2014       876      X    2016       856
1      D     2    2015       789      Y    2017       889
2      D     2    2015       789      Z    2019       763
3      K     2    2014       863      Y    2017       889
4      K     2    2014       863      Z    2019       763
5      A     3    2015       673      U    2018       873
6      A     3    2015       673      V    2020       641
7      B     3    2014       741      U    2018       873
8      B     3    2014       741      V    2020       641

In [35]:
pd.merge(xl,xr,on='Rank',how='inner')

  Team_x  Rank  Year_x  Points_x Team_y  Year_y  Points_y
0      R     1    2014       876      X    2016       856
1      D     2    2015       789      Y    2017       889
2      D     2    2015       789      Z    2019       763
3      K     2    2014       863      Y    2017       889
4      K     2    2014       863      Z    2019       763
5      A     3    2015       673      U    2018       873
6      A     3    2015       673      V    2020       641
7      B     3    2014       741      U    2018       873
8      B     3    2014       741      V    2020       641

In [36]:
xl.merge(xr,on='Rank',how='left')

  Team_x  Rank  Year_x  Points_x Team_y  Year_y  Points_y
0      R     1    2014       876      X    2016       856
1      D     2    2015       789      Y    2017       889
2      D     2    2015       789      Z    2019       763
3      K     2    2014       863      Y    2017       889
4      K     2    2014       863      Z    2019       763
5      A     3    2015       673      U    2018       873
6      A     3    2015       673      V    2020       641
7      B     3    2014       741      U    2018       873
8      B     3    2014       741      V    2020       641

In [37]:
xl.merge(xr,on='Rank',how='right')

  Team_x  Rank  Year_x  Points_x Team_y  Year_y  Points_y
0      R     1    2014       876      X    2016       856
1      D     2    2015       789      Y    2017       889
2      K     2    2014       863      Y    2017       889
3      D     2    2015       789      Z    2019       763
4      K     2    2014       863      Z    2019       763
5      A     3    2015       673      U    2018       873
6      B     3    2014       741      U    2018       873
7      A     3    2015       673      V    2020       641
8      B     3    2014       741      V    2020       641

## What is the difference between list and tuples in Python?

In [38]:
""" list is mutable and tuples are immutable.
    list can be represented within [] while tuple represented within ().
    tuple is faster comparitive to list """

' list is mutable and tuples are immutable.\n    list can be represented within [] while tuple represented within ().\n    tuple is faster comparitive to list '

### Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [40]:
array1=np.array([1,5,3,100,4,48])

In [41]:
array1.mean()

26.833333333333332

In [44]:
array1.std()

36.59424666377065

In [45]:
np.median(array1)

4.5

### How will you remove duplicate elements from a list?

In [47]:
list1=[1,2,3,4,2,3,7,5,8,3,2,6,5,8]
s=set(list1)

In [48]:
s

{1, 2, 3, 4, 5, 6, 7, 8}

In [49]:
list1=s

In [50]:
list1

{1, 2, 3, 4, 5, 6, 7, 8}

## What is a map() function in Python? Give an example

In [52]:
list1=[2,3,6,9,8,7,10,24,15,17]
s=list(map(lambda X: X%2==0,list1))
s

[True, False, True, False, True, False, True, True, False, False]

In [ ]:
"""every item in the list will be returned based on the function performed irresptecive if its true or false """

## What is pass in Python?

In [54]:
"""Once pass is specified the function does not continue it stops once it rechaes to pass.pass is used in places where the function has to be written but can be ignored for now."""

'Once pass is specified the function does not continue it stops once it rechaes to pass.pass is used in places where the function has to be written but can be ignored for now.'

## What is vstack() in numpy? Give an example

In [55]:
## Array is arranged in the vertical stack

In [56]:
list1=[[1,2,3],[3,4,5]]
list2=[[6,7,8],[9,0,1]]
s=np.vstack((list1,list2))

In [57]:
s

array([[1, 2, 3],
       [3, 4, 5],
       [6, 7, 8],
       [9, 0, 1]])